{
	"navigation": [{
		"href": "/",
		"title": "Головна"
	}, {
		"href": "speakers",
		"title": "Спікери"
	}, {
		"href": "workshops",
		"title": "Воркшопи"
	}, {
		"href": "schedule",
		"title": "Розклад"
	}, {
		"href": "tickets",
		"title": "Квитки",
		"isFlare": true
	}, {
		"href": "partners",
		"title": "Партнери"
	}, {
		"href": "contacts",
		"title": "Контакти"
	}],
	"pages": {
		"index": {
			"title": "LvivCSS'19 — конференція не тільки про CSS",
			"description": "LvivCSS'19, найяскравіша конференція України. Конференція не тільки про CSS",
			"ogUrl": "",
			"ogImage": "cover.jpg"
		},
		"speakers": {
			"title": "Це — спікери LvivCSS'19. Вони готують для тебе свої доповіді.",
			"description": "Найкращі спікери з України та Білорусі, що виступатимуть на LvivCSS'19, найяскравішій конференції України",
			"ogUrl": "speakers.html",
			"ogImage": "cover.jpg"
		},
		"workshops": {
			"title": "Це — воркшопи, що пройдуть 3 листопада на LvivCSS'19.",
			"description": "Хочеш закріпити почуте на доповідях на практиці? Ласкаво просимо до участі в воркшопах, або ж майстер-класах!",
			"ogUrl": "workshops.html",
			"ogImage": "cover.jpg"
		},
		"tickets": {
			"title": "Квитки на LvivCSS'19. Якщо в тебе буде такий, ти зможеш відвідати найкрутішу конференцію про frontend. Так просто.",
			"description": "Тут ти можеш придбати квиток на конференцію, якщо в тебе ще досі такого нема. А чому це в тебе його досі нема?!",
			"ogUrl": "tickets.html",
			"ogImage": "cover.jpg"
		},
		"partners": {
			"title": "Це — партнери LvivCSS'19. Вони допомагають нам робити конференцію і дуже чекають на тебе.",
			"description": "Найкращі партнери, що підтримують LvivCSS'19, найяскравішу конференцію України",
			"ogUrl": "partners.html",
			"ogImage": "cover.jpg"
		},
		"contacts": {
			"title": "Це — контакти організаторів LvivCSS'19",
			"description": "Організатори дуже стараються, щоб LvivCSS'19 вийшла такою, щоб про неї переповідали прийдешні покоління. І тільки хороше.",
			"ogUrl": "contacts.html",
			"ogImage": "cover.jpg"
		}
	},
	"speakers": [{
			"id": "shpilevska",
			"speakerName": "Олена Шпілевська",
			"city": "Львів",
			"speakerBio": "Hard-boiled UX Architect, богиня верстки, щаслива, незламна мама випускників двох українських IT-шкіл і просто чудова, перманентно позитивна дівчина. Пропагує пацифізм у вирішенні конфліктів дизігнерів і девів, вчить основам людино-орієнтованого дизайну і обдуманої верстки. Любить карати злісних невиконувачів домашок і займатися йогою на галявинці ^^",
			"talkName": "Ніч темна і повна dark pattern'ів.",
			"talkDescription": "Розповість нам про найтемніші патерни (або патерни непрямої маніпуляції), які так полюбляє використовувати бізнес в погоні за прибутком, і які треба відсіювати на ранніх етапах розробки проекту."
		},
		{
			"id": "artyukh",
			"speakerName": "Юрій Артюх",
			"city": "Київ",
			"speakerBio": "Юрій є парубок моторний, любить верстку та webgl, кавуни та бачату. Навіть якщо доповідь не зайде, зможе станцювати та розважити публіку. Наразі веде прямі трансляції на youtube та регулює технічні питання у своїй команді Coderiver. Скерував декілька мільйонів пікселів, зверстав понад 1000 макетів, провів понад 70 трансляцій про анімації, має сертифікат учасника чемпіонату з бачати, один раз випив 8 кавунових фрешів за добу.",
			"talkName": "Історія іншої анімації. Абсолютно іншої.",
			"talkDescription": ""
		},
		{
			"id": "shynkevych",
			"speakerName": "Олександра Шинкевич",
			"city": "Мінськ",
			"speakerBio": "Фулстек-розробник на node.js, спів&shy;організатор MinskCSS, MinskJS, CSS-Minsk-JS. Займається фронтендом ще зі школи, магістр технічних наук. Верстала ще таблицями, і за свою кар'єру розробника пройшла шлях від jQuery до VanillaJS, і назад до фреймворків Angular, React і Vue.js. А потім вигоріла і звільнилась з посади керівника відділу фронтенд-розробки.",
			"talkName": "You might not need Bootstrap.",
			"talkDescription": ""
		},
		{
			"id": "yuhnovych",
			"speakerName": "Павло Юхнович",
			"city": "Мінськ",
			"speakerBio": "66-разовий чемпіон по BeerJS Minsk у важкій вазі, співорганізатор різних івентів, спікер на всяких цих ваших айтішних конференціях, записує YouTube інтерв'ю, а у вільний від BeerJS час керує командою розробників на великому проекті, менторить і читає лекції по React і Node. Свій сябр в дошку.",
			"talkName": "Неймовірні пригоди девелопера в дизайн-системах.",
			"talkDescription": "Втомилися від постійно мінливих вимог в ТЗ? Девелопили компонент пів-спринта, а виявилося, що ваш джун Валера вже зробив його місяць тому? Який з 50 відтінків червоного використовувати для кнопки «Ніт»? Нема ради на питання «Який тут розмір шрифта» отримувати відповідь «Ну, придумай щось»? Павло має відповідь на всі ці (і навіть більше) питання. Чи можна вважати дизайн-системи срібною кулею від усіх цих напастей? Приходьте на доповідь Павла Юхновича і дізнайтесь про це з перших рук!"
		},
		{
			"id": "dubko",
			"speakerName": "Микита Дубко",
			"city": "Мінськ",
			"speakerBio": "Frontend-розробник та CSS-інженер. Доброзичливий бородань. Організатор мітапів MinskCSS, MinskJS, співорганізатор конференції CSS-Minsk-JS. Радкатор новин спільноти Веб-стандарти. Ще в школі зверстав шкільний сайт, потім працював з базами даних та бекендом на C#, але неминуче повернувся у фронтенд. Дає грошей Юрі Артюху на стріми.",
			"talkName": "CSS — мова програмування.",
			"talkDescription": "Деякі програмісти стверджують, що, як вони вже програмісти, то хай CSS верстальники роблять. А якщо довести їм, що CSS — мова програмування? І Микита доведе. А потім доведе, як з цього безглуздого знання витягти якомога більше корисного — застосовувати найкращі практики програмування в написанні коду для верстки."
		}, {
			"speakerName": "Владлен Федосов",
			"id": "fedosov",
			"city": "Харків",
			"talkName": "Як будувати дизайн-системи з WebComponents.",
			"speakerBio": "Запальний t-shaped інженер, що працював як Senior Software Engineer Team Lead Scrum Master Product Owner Head технічного напрямку, Solution Architect та DevOps. Точно знає, як будувати продукти, що вирішують справжні людські проблеми, та знає, як керувати всім цим безумством.",
			"talkDescription": "Дизайн-система повинна бути на проекті. І про це вам розкажуть інші спікери. А Владлен, в свою, чергу, розповість про те, як створювати доступні, відтестовані та консистентні реалізації компонентів для цих дизайн-систем, які, до того ж, можна використовувати незалежно від того, Angular у вас, Vue чи React. Від теорії до практики!"
		}, {
			"id": "kalyuzhny",
			"speakerName": "Олексій Калюжний",
			"city": "Полтава",
			"speakerBio": "Магістр SVG, frontend-розробник, ніндзя Вордпресу, що має вже понад 10 років різноманітного та насиченого професійного досвіду. Провідний викладач в Beetroot Academy, багаторазовий фіналіст, переможець і суддя чемпіонату DEV Challenge.",
			"talkName": "Ще більше секретів SVG.",
			"talkDescription": "Чи може SVG щось приховувати у 2019 році? Юний дослідник Олексій вирушить на пошуки секретів до країни Масштабованої Векторної Графіки, і розкаже нам, які пригоди його там чекали, які таємниці йому вдалось вивідати, і які трюки вам варто робити саме з SVG в сучасній веб-розробці. Його доповідь дасть однозначну відповідь на питання «А шо, так можна було?!» і покаже найкращі та неоднозначні рішення на SVG для повсякденної та неординарної веб-розробки."
		}, {
			"id": "dytsyak",
			"speakerName": "Василь Дицяк",
			"city": "Київ",
			"speakerBio": "Фронтенд, авжеж сеньор, девелопер. Герой ордену вайті вищого ступеня. Співзасновник секти шанувальників Flutter, а з тим і гребець-невільник на ReactNative. Цього року вперше для себе відкрив публічні виступи. Поки — подобається. Підходьте привітатися, та не ображайтеся проповідям про Flutter.",
			"talkName": "Дивимось сьогодні в завтрашній день разом з Flutter."
		}, {
			"id": "savitskyj",
			"speakerName": "Роман Савіцький",
			"city": "Житомир",
			"speakerBio": "Людина з великою печінкою (співзасновник beerJS Zhytomyr), а також поганими нервами (співорганізатор frontend://zt та OdessaJS). У вільний від конференцій час працює в Infopulse техлідом, тімлідом. Арбітр футболу і DevChallenge2019, тому може вирішити будь-який спір. Працюю зі всім не стандартним. Затягнув в проект вебкомпоненти до того, як це стало мейнстрімом. Заполіфілив і випилив натівні вебкомпоненти. Жду, коли це стане мейнстрімом",
			"talkName": "Web components & lit-element в продакшені.",
			"talkDescription": "Далекого 2016 року світ почув про вебкомпоненти, а одна, тоді ще не дуже розумна команда, якій необхідно було верстати дуже багато, вирішила спробувати те все в продукті, який допоміг зменшити верстку. Про біди вебкомпонентів відомо всім, але про те, як вижити і дійти з альфи до стабільної версії знають не багато. Всі вузькі місця, обмеження і про те, як lit-element з’явився в проекті. Після чого 2 співробітника звільнилось, але через рік всім стало жити набагато краще. Happy end гарантовано."
		}, {
			"id": "mishchenko",
			"speakerName": "Катерина Міщенко",
			"city": "Харків",
			"speakerBio": "Завжди каже: «Нормально роби — нормально буде». Десять років тому прийшла у верстку і не змогла знайти вихід. Пройшла всі стадії: заперечення, гнів, байдужість і прийняття факту, що світчером їй не стати. За весь цей час Катерина набила чимало шишок і зробила висновки. Випалює очі кодом і, разом з тим, розвиває компетенцію верстки в Sigma Software. І якщо вам здається, що верстка помирає, то приходьте послухати її доповiдь про те, чому це вам тiльки здається ;)",
			"talkName": "Верстальник — теж людина",
			"talkDescription": "Кар'єрний шлях веб-розробника може бути важким та тернистим. Кожного дня ми стикаємося з новими викликами, технологіями, методологіями, специфікаціями. Як вижити в цьому буремному світі, як не загубитися в сучасній розробці, як навчитися використовувати вже набуті знання не змінюючи радикально професійну сферу і залишатися при цьому цінним та затребуваним спеціалістом? Про це все і розкаже Катерина, яка точно знає, що верстальник — не вирок, а навпаки, саме той шлях, який може відкрити двері майже до кожної галузі в розробці."
		}, {
			"id": "babich",
			"speakerName": "Сергій Бабіч",
			"city": "Львів",
			"speakerBio": "Awesome frontend developer, батько трьох дітей та конференції LvivCSS. Людина, яка придумала замість глупих відмазок, щоб втікти на кілька днів з дому, проводити івенти в інших містах. Якщо ви його ще не знаєте, це значить, що він просто ще не робив івент у вас. Упоротий наглухо фанат HTML та CSS, за float і color рефловить в упор.",
			"talkName": "Як я робив найкращий сайт для найкращої конференції",
			"talkDescription": "Як можна зробити швидкий, легкий, надійний сайт для конференції без фреймворків, з допомогою технологій, які ще минулого року здавалися чимось космічним, а вже сьогодні є чимось буденним і лише з малесенькою домішкою JavaScript? За допомогою яких інструментів можна зробити сайт дійсно зручним і насправді корисним для відвідувачів?"
		}, {
			"id": "stanyshevskiy",
			"speakerName": "Віталій Станишевський",
			"city": "Львів",
			"speakerBio": "За 8 років професійного життя працював з різними технологіями — Java, PHP, .NET, проте зрозумів, що серце прагне прекрасного. На разі — Sr Frontend developer. Не вірить в маршрутки, проте вірить в роботу віддалено. В дитинстві дивився «Секс у великому місті», що і визначило життя Віталія — 2 роки тому переїхав з Ужгорода у Львів та займається проектом секс-едукації українських тінейджерів у вільний час.",
			"talkName": "Доступно про інтимне"
		}, {
			"id": "tulinovskyi",
			"speakerName": "Владислав Туліновський",
			"speakerBio": "Влад, UX/UI дизайнер интерфейсів з більш, ніж чотирирічним досвідом роботи. Працював на проектах Minibar delivery, b-reel.com, hugeinc.com, sezane.com, otzovik.com.ua, Dexilon, Box Exchanger. Дизайнер компанії Vidax (Франція), Head UX дизайнер Dexilon (Bershka, Zara і т.д). Потенційно зміг в UX, вічний розпалювач конфліктів між дизайнером та розробником. Кредо — «Що намалював дизайнер, розробник може зробити вдвічі крутіше». Задається питанням «UX дизайн — один з прийомів психологічного насилля?» Жаліється, що стендапером йому не бути.",
			"talkName": "Як приборкати Typographicus Exoticus",
			"talkDescription": "Що взагалі таке типографіка, і яким чином вона допомагає робити наші продукти кращими, зручнішими, гарнішими? Як працюють шрифти? Кому потрібна та типографіка, і як переконати бізнес в тому, що текст, який гарно виглядає, допоможе йому стати ще бізнесовішим? І, головне, як приборкати складну науку типографіку, якщо ти звичайний веб-розробник і хочеш просто верстати формочки?",
			"city": "Харків"
		},
		{
			"id": "nemtsev",
			"speakerName": "Антон Немцев",
			"city": "Амстердам",
			"speakerBio": "Незалежний розробник протягом 16 рокiв. Не витримав лихої долі і запродався корпораціям. Jack of all trades, master of none. Швидше останнє. Головний редактор Frontender Magazine. Все пустив за вітром. Доповідач на міжнародних та місцевих конференціях, експерт UA Web Challenge. Був колись. Чарівний розмовляючий ведмедь.",
			"talkDescription": "Всі люблять теревенити про продуктивність та як це важливо, але майже ніхто не знає поточну продуктивість і як вона змінюється з часом. Давайте розберемося, як вимірювати продуктивність та візуалізувати її зміни, і які стандарти нам можуть в цьому допомогти.",
			"talkName": "Відстежування продуктивності в проекті."
		}
	],
	"workshops": [{
		"speakerId": "shpilevska",
		"title": "Вчимося розпізнавати та виправляти dark patterns.",
		"about": "В продовження доповіді Олена покаже на практиці, як саме шукати dark patterns, визначати їх шкідливість та знаходити шляхи їх виправлення. Під час практикуму ви розглянете конкретні приклади використання таких патернів, розберете, на що саме вони впливають, як саме погіршують взаємодію з продуктом, та навчитеся знаходити обхідні шляхи таких сценаріїв UX."
	}, {
		"id": "chaykovskyi",
		"name": "Юрій Чайковський",
		"title": "Accessibility на практиці",
		"about": "Під час практичного заняття з Юрієм ви засвоїте основні критерії доступності у веб, навчитеся аналізувати веб-сторінку на предмет доступності та дізнаєтеся про інструменти для розробників, які варто використовувати у щоденній роботі. Ви дізнаєтеся про ARIA атрибути, як правильно використовувати теги, та як зберігати семантичну структуру DOM дерева. У якості бонусу, розберемо як працюють screen reader і звідки вони знають, що саме треба читати на сторінці. Та, найголовніше, побачите, що доступність сайтів — це не додатковий функціонал, а рутині речі, використання яких вирізняє хорошого програміста серед сірої маси."
	}, {
		"speakerId": "tulinovskyi",
		"title": "Шукаємо спільну мову між розробником та дизайнером",
		"about": "Ви розберетесь на практиці що таке style guide, вому він такий важливий, навіщо потрібен на проекті, і чому дизайнер повинен його створити та передати розробникам. Визначите необхідність правил іменування елементів в макетах, зрозумієте що таке дизайн-система, і для чого розробникам її розуміти. Оглянете інструменти Figma та Zeplin та їм можливості полегшувати комунікації між дизайнером та розробником. Спробуєте зрозуміти, чи зручно зберігати все в хмарі, чи все-таки краще тримати гігабайти макетів у себе, та навчитеся експортувати елементи в один клік."
	}, {
		"speakerId": "dytsyak",
		"title": "Пишемо перший застосунок на Flutter",
		"about": "Під час заняття ви зробите свої перші кроки у написанні додатку на Flutter. Розглянемо доступний інструментарій, спробуємо як працює на практиці неперевершений хот-релоад. Познайомимося з мовою програмування Dart, зверстаємо декілька компонентів та відчуємо різницю між версткою у Flutter та CSS. Спробуємо запустити наш додаток на різних платформах — мобільній, браузері та десктопі"
	}],
	"partners": [{
		"name": "gold",
		"title": "Золоті",
		"items": [{
				"logo": "coingaming.svg",
				"name": "Coingaming",
				"url": "https://coingaming.io"
			},
			{
				"logo": "svitla.svg",
				"name": "Svitla Systems",
				"url": "https://svitla.com"
			}
		]
	}, {
		"name": "silver",
		"title": "Срібні",
		"items": [{
			"logo": "newfire.png",
			"name": "Newfire Partners",
			"url": "https://www.gonewfire.com"
		}]
	}, {
		"name": "bronze",
		"title": "Бронзові",
		"items": [{
			"logo": "sigma.svg",
			"name": "Sigma Software",
			"url": "https://sigma.software/"
		}, {
			"logo": "keenethics.svg",
			"name": "Keenethics",
			"url": "https://keenethics.com/"
		}, {
			"logo": "lohika.svg",
			"name": "Lohika",
			"url": "https://www.lohika.com.ua/"
		}, {
			"logo": "conscensia.svg",
			"name": "Conscensia",
			"url": "https://www.conscensia.com/"
		}]
	}, {
		"name": "info",
		"title": "Інформаційні",
		"items": [{
			"logo": "vinnytsiajs.jpg",
			"name": "VinnytsiaJS"
		}, {
			"logo": "girl-in-tech.jpg",
			"name": "GIRL IN TECH",
			"url": "https://t.me/girlintech"
		}, {
			"logo": "css-minsk-js.svg",
			"name": "CSS-Minsk-JS",
			"url": "https://css-minsk-js.by/"
		}, {
			"logo": "frontendua.svg",
			"name": "Frontend UA",
			"url": "https://twitter.com/frontend_ua"
		}, {
			"logo": "frontend-magazine.svg",
			"name": "Frontend Magazine",
			"url": "https://www.facebook.com/groups/frontend.magazine"
		}, {
			"logo": "kharkivcss.svg",
			"name": "KharkivCSS",
			"url": "http://kharkivcss.org"
		}, {
			"logo": "beerjskyiv.svg",
			"name": "BeerJS Kyiv",
			"url": "t.me/punkjs"
		}, {
			"logo": "mtdv.png",
			"name": "MTDV",
			"url": "https://mtdv.io"
		}, {
			"logo": "codeguida.jpg",
			"name": "Codeguida",
			"url": "https://codeguida.com/"
		}, {
			"logo": "beerjszt.svg",
			"name": "BeerJS Житомир",
			"url": "https://www.facebook.com/groups/beerJSZhytomyr/"
		}]
	}],
	"schedule": {
		"tracks": [{
			"title": "Зала А",
			"id": "a"
		}, {
			"title": "Зала Б",
			"id": "b"
		}, {
			"title": "Куточок спікерів",
			"id": "c"
		}, {
			"title": "Куточок спільнот",
			"id": "d"
		}],
		"items": [
			{ "time": "10:00", "title": "Відкриття" },
			{
				"time": "10:00",
				"tracks": [
					{ "trackId": "a", "speakerId": "shpilevska" },
					{ "trackId": "b", "speakerId": "fedosov" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "10:40" },
			{
				"time": "10:50",
				"tracks": [
					{ "trackId": "a", "speakerId": "dubko" },
					{ "trackId": "b", "speakerId": "yukhnovych" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "11:30" },
			{
				"time": "11:40",
				"tracks": [
					{ "trackId": "a", "speakerId": "shpilevska" },
					{ "trackId": "b", "speakerId": "fedosov" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "12:20" },
			{
				"time": "12:30",
				"tracks": [
					{ "trackId": "a", "speakerId": "dubko" },
					{ "trackId": "b", "speakerId": "yukhnovych" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "13:10", "title": "Обід" },
			{
				"time": "14:10",
				"tracks": [
					{ "trackId": "a", "speakerId": "shpilevska" },
					{ "trackId": "b", "speakerId": "fedosov" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "14:50" },
			{
				"time": "15:00",
				"tracks": [
					{ "trackId": "a", "speakerId": "dubko" },
					{ "trackId": "b", "speakerId": "yukhnovych" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "15:40" },
			{
				"time": "15:50",
				"tracks": [
					{ "trackId": "a", "speakerId": "shpilevska" },
					{ "trackId": "b", "speakerId": "fedosov" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "16:30" },
			{
				"time": "16:40",
				"tracks": [
					{ "trackId": "a", "speakerId": "dubko" },
					{ "trackId": "b", "speakerId": "yukhnovych" },
					{ "trackId": "c" },
					{ "trackId": "d", "title": "" }
				]
			},
			{ "time": "17:20", "title": "Урочисте закриття конференції" },
			{ "time": "18:00", "title": "Афтепаті" }
		]
	}
}